# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([3, -5, 7, 4], index = ['a', 'b', 'c', 'd'])

In [3]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [4]:
data = {
    'Country'  :  ['Belgium', 'India', 'Brazil'],
        'Capital'  :    ['Brussels', 'New Delhi', 'Brasilia'],
        'Poulation'  :   np.array( [3,4,5])
}

In [5]:
 pd.DataFrame(data = data, columns = ['Country', 'Capital', 'Population'])

   Country    Capital Population
0  Belgium   Brussels        NaN
1    India  New Delhi        NaN
2   Brazil   Brasilia        NaN

In [6]:
data = pd.read_csv('sal.csv')         #Read CSV

In [7]:
data.head()                                  #viewing data

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [8]:
data.tail(5)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [9]:
data.index

RangeIndex(start=0, stop=32560, step=1)

In [10]:
data.columns                      #shows available columns

Index(['39', ' State-gov', '77516', ' Bachelors', '13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', '2174', '0', '40',
       ' United-States', ' <=50K'],
      dtype='object')

In [11]:
data.describe()                     #Quick statistic summary of data

,39,77516,13,2174,0,40
count,32560.000000,3.256000e+04,32560.000000,32560.000000,32560.000000,32560.000000
mean,38.581634,1.897818e+05,10.080590,1077.615172,87.306511,40.437469
std,13.640642,1.055498e+05,2.572709,7385.402999,402.966116,12.347618
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178315e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783630e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370545e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [12]:
data.T                    #Transpose

,0,1,2,3,4,5,6,7,8,9,...,32550,32551,32552,32553,32554,32555,32556,32557,32558,32559
39,50,38,53,28,37,49,52,31,42,37,...,32,43,32,53,22,27,40,58,22,52
State-gov,Self-emp-not-inc,Private,Private,Private,Private,Private,Self-emp-not-inc,Private,Private,Private,...,Private,Private,Private,Private,Private,Private,Private,Private,Private,Self-emp-inc
77516,83311,215646,234721,338409,284582,160187,209642,45781,159449,280464,...,34066,84661,116138,321865,310152,257302,154374,151910,201490,287927
Bachelors,Bachelors,HS-grad,11th,Bachelors,Masters,9th,HS-grad,Masters,Bachelors,Some-college,...,10th,Assoc-voc,Masters,Masters,Some-college,Assoc-acdm,HS-grad,HS-grad,HS-grad,HS-grad
13,13,9,7,13,14,5,9,14,13,10,...,6,11,14,14,10,12,9,9,9,9
Never-married,Married-civ-spouse,Divorced,Married-civ-spouse,Married-civ-spouse,Married-civ-spouse,Married-spouse-absent,Married-civ-spouse,Never-married,Married-civ-spouse,Married-civ-spouse,...,Married-civ-spouse,Married-civ-spouse,Never-married,Married-civ-spouse,Never-married,Married-civ-spouse,Married-civ-spouse,Widowed,Never-married,Married-civ-spouse
Adm-clerical,Exec-managerial,Handlers-cleaners,Handlers-cleaners,Prof-specialty,Exec-managerial,Other-service,Exec-managerial,Prof-specialty,Exec-managerial,Exec-managerial,...,Handlers-cleaners,Sales,Tech-support,Exec-managerial,Protective-serv,Tech-support,Machine-op-inspct,Adm-clerical,Adm-clerical,Exec-managerial
Not-in-family,Husband,Not-in-family,Husband,Wife,Wife,Not-in-family,Husband,Not-in-family,Husband,Husband,...,Husband,Husband,Not-in-family,Husband,Not-in-family,Wife,Husband,Unmarried,Own-child,Wife
White,White,White,Black,Black,White,Black,White,White,White,Black,...,Amer-Indian-Eskimo,White,Asian-Pac-Islander,White,White,White,White,White,White,White
Male,Male,Male,Male,Female,Female,Female,Male,Female,Male,Male,...,Male,Male,Male,Male,Male,Female,Male,Female,Male,Female
2174,0,0,0,0,0,0,0,14084,5178,0,...,0,0,0,0,0,0,0,0,0,15024
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
40,13,40,40,40,40,16,45,50,40,80,...,40,45,11,40,40,38,40,40,20,40
United-States,United-States,United-States,United-States,Cuba,United-States,Jamaica,United-States,United-States,United-States,United-States,...,United-States,United-States,Taiwan,United-States,United-States,United-States,United-States,United-States,United-States,United-States
<=50K,<=50K,<=50K,<=50K,<=50K,<=50K,<=50K,>50K,>50K,>50K,>50K,...,<=50K,<=50K,<=50K,>50K,<=50K,<=50K,>50K,<=50K,<=50K,>50K

In [13]:
data.sort_index(axis=1, ascending=False).head()         #sorting by an axis i.e. column

,77516,40,39,2174,13,0,White,United-States,State-gov,Not-in-family,Never-married,Male,Bachelors,Adm-clerical,<=50K
0,83311,13,50,0,13,0,White,United-States,Self-emp-not-inc,Husband,Married-civ-spouse,Male,Bachelors,Exec-managerial,<=50K
1,215646,40,38,0,9,0,White,United-States,Private,Not-in-family,Divorced,Male,HS-grad,Handlers-cleaners,<=50K
2,234721,40,53,0,7,0,Black,United-States,Private,Husband,Married-civ-spouse,Male,11th,Handlers-cleaners,<=50K
3,338409,40,28,0,13,0,Black,Cuba,Private,Wife,Married-civ-spouse,Female,Bachelors,Prof-specialty,<=50K
4,284582,40,37,0,14,0,White,United-States,Private,Wife,Married-civ-spouse,Female,Masters,Exec-managerial,<=50K

In [14]:
data.columns = ['Age', 'Job Category', '#' , 'Degree' , 'Worked Year' , 'Martinal Status' , 'Post' , 'Personal Status' , 'Type of job' ,'Gender', '', '', 'Year', 'Country' , 'Salary']

In [15]:
data.head()

,Age,Job Category,#,Degree,Worked Year,Martinal Status,Post,Personal Status,Type of job,Gender,,,Year,Country,Salary
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [16]:
data.loc[[1028]]

,Age,Job Category,#,Degree,Worked Year,Martinal Status,Post,Personal Status,Type of job,Gender,,,Year,Country,Salary
1028,48,Self-emp-inc,138370,Masters,14,Married-spouse-absent,Sales,Not-in-family,Asian-Pac-Islander,Male,0,0,50,India,<=50K